app/controllers/chap_five_controller.rb

def map
 @parcels=Parcel.find :all,
                      :conditions=>"lat IS NOT NULL"
---
SELECT * FROM `parcels` WHERE (lat IS NOT NULL AND acct_type='COMMERCIAL')