app/controllers/chap_six_controller.rb

 def map
   @parcels= Parcel.find :all,
                         :conditions=>"lat IS NOT NULL AND lng IS NOT NULL"
---
SELECT * FROM `parcels` WHERE (lat IS NOT NULL AND lng IS NOT NULL)