app/controllers/owners_controller.rb

SELECT * FROM `owners`
---
  def index
    @owners = Owner.all

SELECT * FROM `owners` WHERE (`owners`.`id` = 1)
---
  def show
    @owner = Owner.find(params[:id])

INSERT INTO `owners` (`percentage_own`, `updated_at`, `account_no`, `created_at`) VALUES(100, '2010-02-11 17:39:32', 10066050, '2010-02-11 17:39:32')
---
  def create
    @owner = Owner.new(params[:owner])

    respond_to do |format|
      if @owner.save