app/controllers/parcels_controller.rb

SELECT * FROM `parcels`
---
  def index
    @parcels = Parcel.all

SELECT * FROM `parcels` WHERE (`parcels`.`id` = 1)
---
  def show
    @parcel = Parcel.find(params[:id])

SELECT * FROM `parcels` WHERE (`parcels`.`id` = 1)
---
  def edit
    @parcel = Parcel.find(params[:id])

INSERT INTO `parcels` (`liber`, `street_no`, `street_name`, `city`, `prop_type`, `occ_code`, `zip`, `value_type`, `blt_as_id`, `acres`, `stories`, `acct_no`, `blt_as_desc`, `parcel_nb`, `abst_desc`, `street_type`, `lotsf`, `yr_blt`, `occ_desc`, `lng`, `acct_type`, `street_dir`, `street_alpha`, `grossf`, `folio`, `netsf`, `zoning`, `lat`, `state`, `abst_code`, `park_space`) VALUES(NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    @parcel = Parcel.new(params[:parcel])

    respond_to do |format|
      if @parcel.save

SELECT * FROM `parcels` WHERE (`parcels`.`id` = 30)
DELETE FROM `parcels` WHERE `id` = 30
---
  def destroy
    @parcel = Parcel.find(params[:id])
    @parcel.destroy